## Time Shifting

Sometimes you may need to shift all your data up or down along a time series index.

In [21]:
import pandas as pd

In [22]:
df = pd.read_csv("./data/section_6/starbucks.csv", index_col="Date", parse_dates=True)

In [23]:
df.head()

              Close    Volume
Date
2015-01-02  38.0061   6906098
2015-01-05  37.2781  11623796
2015-01-06  36.9748   7664340
2015-01-07  37.8848   9732554
2015-01-08  38.4961  13170548

In [24]:
df.tail()

            Close    Volume
Date
2018-12-24  60.56   6323252
2018-12-26  63.08  16646238
2018-12-27  63.20  11308081
2018-12-28  63.39   7712127
2018-12-31  64.40   7690183

In [25]:
# shift all the rows down by 1 row
# note: the last row is dropped since it is shifting beyond the DataFrame index

df.shift(1)

              Close      Volume
Date
2015-01-02      NaN         NaN
2015-01-05  38.0061   6906098.0
2015-01-06  37.2781  11623796.0
2015-01-07  36.9748   7664340.0
2015-01-08  37.8848   9732554.0
...             ...         ...
2018-12-24  61.3900  23524888.0
2018-12-26  60.5600   6323252.0
2018-12-27  63.0800  16646238.0
2018-12-28  63.2000  11308081.0
2018-12-31  63.3900   7712127.0

[1006 rows x 2 columns]

In [26]:
# shift all the rows up by 1 row
# note: the first row is dropped since it is shifting beyond the DataFrame index

df.shift(-1)

              Close      Volume
Date
2015-01-02  37.2781  11623796.0
2015-01-05  36.9748   7664340.0
2015-01-06  37.8848   9732554.0
2015-01-07  38.4961  13170548.0
2015-01-08  37.2361  27556706.0
...             ...         ...
2018-12-24  63.0800  16646238.0
2018-12-26  63.2000  11308081.0
2018-12-27  63.3900   7712127.0
2018-12-28  64.4000   7690183.0
2018-12-31      NaN         NaN

[1006 rows x 2 columns]

In [27]:
# fill for NaN rows

df.shift(1, fill_value="SET VALUE")

                Close     Volume
Date
2015-01-02  SET VALUE  SET VALUE
2015-01-05    38.0061    6906098
2015-01-06    37.2781   11623796
2015-01-07    36.9748    7664340
2015-01-08    37.8848    9732554
...               ...        ...
2018-12-24      61.39   23524888
2018-12-26      60.56    6323252
2018-12-27      63.08   16646238
2018-12-28       63.2   11308081
2018-12-31      63.39    7712127

[1006 rows x 2 columns]

In [28]:
df.head()

              Close    Volume
Date
2015-01-02  38.0061   6906098
2015-01-05  37.2781  11623796
2015-01-06  36.9748   7664340
2015-01-07  37.8848   9732554
2015-01-08  38.4961  13170548

In [29]:
# https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases
# this example shifts everything over by 1 month

df.shift(periods=1, freq="M")

# the closing values for january shift to 2015-01-31
# likewise, the closing values for february, march, and so on, will shift to their ending month date, respectively

              Close    Volume
Date
2015-01-31  38.0061   6906098
2015-01-31  37.2781  11623796
2015-01-31  36.9748   7664340
2015-01-31  37.8848   9732554
2015-01-31  38.4961  13170548
...             ...       ...
2018-12-31  60.5600   6323252
2018-12-31  63.0800  16646238
2018-12-31  63.2000  11308081
2018-12-31  63.3900   7712127
2019-01-31  64.4000   7690183

[1006 rows x 2 columns]